benchmarks/definitive_results/theory/S_default/llama-2-7b/p25_dataset/_0.8_/log_10459346.out
WARNING 10-21 12:43:51 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=50037, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_p25.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=3000, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, profile=False, save_result=True, metadata=None, result_dir='benchmarks/definitive_results/theory/S_default/llama-2-7b/p25_dataset/_0.8_', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--port=50037 --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b --max-num-seqs=3000 --gpu-memory-utilization=0.8', disable_log_stats=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Server started
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     3000      
Benchmark duration (s):                  11.28     
Total input tokens:                      69000     
Total generated tokens:                  81000     
Request throughput (req/s):              266.05    
Output token throughput (tok/s):         7183.41   
Total Token throughput (tok/s):          13302.62  
---------------Time to First Token----------------
Mean TTFT (ms):                          3827.68   
Median TTFT (ms):                        2434.96   
P99 TTFT (ms):                           7903.24   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          190.12    
Median TPOT (ms):                        178.62    
P99 TPOT (ms):                           301.74    
---------------Inter-token Latency----------------
Mean ITL (ms):                           190.08    
Median ITL (ms):                         107.00    
P99 ITL (ms):                            1301.59   
==================================================
Concurrent checker terminated
Server terminated